seededFracture/0.org/pointMotionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
      type            fixedNormalSlip;
      value           uniform (0 0 0);
      n               (0 0 1);

    }

    outlet
    {
      type            fixedNormalSlip;
      value           uniform (0 0 0);
      n               (0 0 1);
    }

    walls
    {
      type            dissolMotion;
      value           uniform (0 0 0);

      scaleMotion     1.0;

      rlxTol          1e-6;

      surfaceRlx      true;
      q_norm_recalc   1;
      k_1             1.0;
      k_2             1.3;
      q_2             5;

      edgeRlx              true;
      q_norm_recalc_edge   1;
      k_1edge              1.0;
      k_2edge              1.3;
      q_2edge              10;

      pinnedPoint     false;
    }

    periodicx1
    {
      type            cyclicSlip;
    }
    periodicx2
    {
      type            cyclicSlip;
    }

}

// ************************************************************************* //
